
Mu=4.794e3;%引力常数
re =1750;%切面半径
c20=-0.113;
c22=0.0396;
xit0=pi/4;%着陆点赤经
fai0=pi/4;%着陆点赤纬
xit1=0.2;%T系与L系经321绕的角度
xit2=0.2;
xit3=0.2;
R0l =1700;%T系原点距小行星质心的长度
Tl=[cos(xit3)*cos(xit1)-sin(xit3)*sin(xit2)*sin(xit1)  cos(xit3)*sin(xit1)+sin(xit2)*sin(xit3)*cos(xit1)   -cos(xit2)*sin(xit3);
            -cos(xit2)*sin(xit1)                                    cos(xit2)*cos(xit1)                          sin(xit2)     ;
    sin(xit3)*cos(xit1)+sin(xit2)*cos(xit3)*sin(xit1)  sin(xit2)*sin(xit1)-sin(xit2)*cos(xit3)*cos(xit1)     cos(xit2)*cos(xit3)];
Gl=[-cos(xit0)*sin(fai0)   sin(xit0)*sin(fai0)    cos(fai0);
       -sin(fai0)               -cos(xit0)            0    ;
     cos(xit0)*cos(fai0)  -sin(xit0)*cos(fai0)    sin(fai0)];
 W =2*pi/5.27/3600;%小行星自旋角速度
 We=Tl*Gl'*[0;0;W];
 Wex=We(1);
 Wey=We(2);
 Wez=We(3);
 A=[Wex^2-W^2   Wex*Wey    Wex*Wez;
    Wex*Wey    Wey^2-W^2   Wey*Wez;
    Wex*Wez     Wey*Wez   Wez^2-W^2];
 B=[   0    -2*Wez    2*Wey;
     2*Wez     0     -2*Wex;
    -2*Wey   2*Wex      0  ];
 R0=Tl*[0;0;R0l];
 
 TA=[0 0 0]';
 TB=[500 0 0]';%特征点位置
 TC=[500 500 0]';
 
 v0=[0.1;0.1;-1.0];
 r0=[200;300;1000];
 %%%%%%%探测器参数
 F=4;%推力
 m0=200;%初始质量
 Isp=300*9.8;%比冲
 %%%%%%%%导航参数
 vg0=[0;-0.1;-0.7];%加表速度初始估值
 rg0=[203;292;998];%加表位置初始估值
 %%%%%%%%制导参数
 T=1200;%下降时间
 
 %%%%%% 喷嘴控制参数
 k=0.008; %权重因子
 a=F/m0;%喷嘴产生的加速度
 a0=2*a*k/(4*a+k);%关曲线系数
 d=0.1;%极限环长度
 b=0.0001*(a+a0)/(2*a*a0);%极限环宽度b<0.1^2*(a+a0)/(2*a*a0) %0.1为速度要求精度
 %%%%%%%%%%%%%%%%% 障碍规避
 Rtb=[-30;50;0];
 %%%%%%%%%%%姿轨耦合
 l=1e-4*[randn,randn,randn];%%%%%%%安装误差
 r=0.5;%%%%%作用半径
 koh=l*r;%%%%%%%耦合系数
 
 
%姿态部分
%-----------------------------------------------------------------
%星体转动惯量参数
%-----------------------------------------------------------------
% 星体惯量阵
  IBd = [93 -0.07 0.0;
        -0.07 80 -0.03;
        0.0   -0.03 107];
  InvIBd = inv(IBd);

%--------------------------------------------------------------------------
%敏感器参数
%--------------------------------------------------------------------------

%相机参数
    NoiseStar = ([0.06 0.02 0.02]/3*pi/180).^2;  %相机测量误差方差
    f=0.02;%相机焦距
% 速率陀螺噪声方差
    Noise_gn = ([1 1 1]*0.0025/3.*pi/180).^2;    %速率陀螺噪声方差
    Noise_rwn = ([1 1 1].*1e-10).^2;             %陀螺漂移随机游动过程的白噪声方差
	Noise_gc = [1 -1 1]*6/3600*pi/180;           %速率陀螺常值漂移
	Wgmax = 10*[1,1,1]'*pi/180;                  %速率陀螺最大测量范围
	AWcc=[1 1 1]*0.15/3600/3*pi/180;             %速率陀螺谐波噪声角频率
	Wcc = [1 1 1]*0.2;                           %速率陀螺谐波噪声幅值
%--------------------------------------------------------------------------
%执行机构参数
%--------------------------------------------------------------------------

% 反作用飞轮特性参数
	JW = [1,1,1,1]*0.0017362;               %反作用飞轮转动惯量（Kgm2）
	invJW = 1 ./JW;
	CWw = [1,1,1,1]*6e-5;                   %飞轮粘性系数(Nm/rad)
	TWi = [1,1,1,1]*5e-6;
	TWf0 = [1,1,1,1]*3e-4;                  %飞轮常值摩擦力矩(Nm)
	IW = [1,1,1,1]*1.e-6;                   %动不平衡力矩系数Nms2
	Wwmax = [1,1,1,1]*5500*2*pi/60;         %反作用飞轮最大角速率（rad/s） 
	Hwmax = JW.*Wwmax;                      %飞轮最大角动量
	Tcmax = [1,1,1,1].*0.02;                %飞轮最大驱动力矩
    HWw0 = [0.01 0.01 0.01 0.01];           %飞轮初始角动量参数
    
    % 飞轮安装矩阵与分配矩阵
    alpha = 60.0/180*pi;
    bata = 54.74/180*pi;
    %安装矩阵（标称状态）
    DWN = [sin(bata)*cos(alpha)  sin(bata)*sin(alpha)  -sin(bata)*cos(alpha)  -sin(bata)*sin(alpha);
            cos(bata)             cos(bata)              cos(bata)             cos(bata);
            -sin(bata)*sin(alpha) sin(bata)*cos(alpha)   sin(bata)*sin(alpha)  -sin(bata)*cos(alpha)];
    MWN = DWN'*inv(DWN*DWN');                       %分配矩阵（标称状态）
 
 
%定向模式飞轮控制参数
Kp = [7.0313;6.0484;8.0898];         %控制器增益系数
Kd = [19.2895;16.6643;22.1166];      %控制器微分系数
Ki = [0.0503;0.0503;0.0503];         %控制器积分系数

%初始姿态参数
%EarthPointing mode
% yaw = 2*pi/180;                       
% pitch = 1*pi/180;                     
% roll = -1*pi/180;                     
% Cb0 = cx(roll) * cy(pitch) * cz(yaw);
QQQ=[-0.00887716742085
     0.00857258093040
     0.01752721821769
     0.99977022528995];  %%%c2q(Cb0);
Qb0 = [QQQ(4);QQQ(1:3)];          %星体坐标系相对地心惯性系的姿态四元素
We0 = [1 1 1]'*0.04*pi/180;             %星体相对轨道坐标系的角速度
HBd0 = IBd*We0;                         %初始星体角动量（docking）
global Pk0;global Xk0;global faik;
% Xk10=[(rg0-r0)' (vg0-v0)' (R0+1e+2*[randn;randn;randn])' (We+1e-4*[randn;randn;randn])' Mu*(1+0.05*randn)]';
Xk10=[(rg0-r0)' (vg0-v0)' (R0+1e+2*[randn;randn;randn])' (We+1e-4*[randn;randn;randn])' Mu-1000 QQQ(1:3)' 0 0 0]';
Pk0=eye(19);
%%%%%%%%%%%%
Pk0(1,1)=(rg0(1)-r0(1))^2;
Pk0(2,2)=(rg0(2)-r0(2))^2;
Pk0(3,3)=(rg0(3)-r0(3))^2;
Pk0(4,4)=(vg0(1)-v0(1))^2;
Pk0(5,5)=(vg0(2)-v0(2))^2;
Pk0(6,6)=(vg0(3)-v0(3))^2;
Pk0(7,7)=(Xk10(7)-R0(1))^2;
Pk0(8,8)=(Xk10(8)-R0(2))^2;
Pk0(9,9)=(Xk10(9)-R0(3))^2;
Pk0(10,10)=(Xk10(10)-We(1))^2;
Pk0(11,11)=(Xk10(11)-We(2))^2;
Pk0(12,12)=(Xk10(12)-We(3))^2;
Pk0(13,13)=(Xk10(13)-Mu)^2;
Pk0(14,14)=(Xk10(14)-QQQ(1))^2;
Pk0(15,15)=(Xk10(15)-QQQ(2))^2;
Pk0(16,16)=(Xk10(16)-QQQ(3))^2;
Pk0(17,17)=(1*6/3600*pi/180)^2;
Pk0(18,18)=(-1*6/3600*pi/180)^2;
Pk0(19,19)=(1*6/3600*pi/180)^2;
% Pk0(20,20)=0;
% Pk0(21,21)=0;
% Pk0(22,22)=0;

% Pk0=Pk0*10;

% Pk0(1,1)=5^2;
% Pk0(2,2)=5^2;
% Pk0(3,3)=5^2;
% Pk0(4,4)=0.1^2;
% Pk0(5,5)=0.1^2;
% Pk0(6,6)=0.1^2;
% Pk0(7,7)=(1e+2)^2;
% Pk0(8,8)=(1e+2)^2;
% Pk0(9,9)=(1e+2)^2;
% Pk0(10,10)=(1e-4)^2;
% Pk0(11,11)=(1e-4)^2;
% Pk0(12,12)=(1e-4)^2;
% Pk0(13,13)=(200)^2;
%%%%%%%%%%%%%%%
    x=Xk10;
    u0=[0 0 0 rg0' vg0' 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0]';
    a407=-(x(13)*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5-x(13)*(x(7)+u0(4))^2*3*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(1/2))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^3+x(11)^2+x(12)^2;
    a408=3*x(13)*(x(7)+u0(4))*(x(8)+u0(5))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(10)*x(11);
    a409=3*x(13)*(x(7)+u0(4))*(x(9)+u0(6))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(10)*x(12);
    a410=-x(11)*(x(8)+u0(5))-x(12)*(x(9)+u0(6));
    a411=2*x(11)*(x(7)+u0(4))-x(10)*(x(8)+u0(5))-2*u0(9);
    a412=2*x(12)*(x(7)+u0(4))-x(10)*(x(9)+u0(6))+2*u0(8);
    a413=-(x(7)+u0(4))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5;
    
    a507=3*x(13)*(x(7)+u0(4))*(x(8)+u0(5))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(10)*x(11);
    a508=-(x(13)*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5-x(13)*(x(8)+u0(5))^2*3*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(1/2))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^3+x(10)^2+x(12)^2;
    a509=3*x(13)*(x(8)+u0(5))*(x(9)+u0(6))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(11)*x(12);
    a510=2*x(10)*(x(8)+u0(5))-x(11)*(x(7)+u0(4))+2*u0(9);
    a511=-x(10)*(x(7)+u0(4))-x(12)*(x(9)+u0(6));
    a512=2*x(12)*(x(8)+u0(5))-x(11)*(x(9)+u0(6))-2*u0(7);
    a513=-(x(8)+u0(5))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5;
    
    a607=3*x(13)*(x(7)+u0(4))*(x(9)+u0(6))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(10)*x(12);
    a608=3*x(13)*(x(8)+u0(5))*(x(9)+u0(6))*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(-2.5)-x(11)*x(12);
    a609=-(x(13)*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5-x(13)*(x(9)+u0(6))^2*3*((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^(1/2))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^3+x(10)^2+x(11)^2;
    a610=2*x(10)*(x(9)+u0(6))-x(12)*(x(7)+u0(4))-2*u0(8);
    a611=2*x(11)*(x(9)+u0(6))-x(12)*(x(8)+u0(5))+2*u0(7);
    a612=-x(10)*(x(7)+u0(4))-x(11)*(x(8)+u0(5));
    a613=-(x(9)+u0(6))/((x(7)+u0(4))^2+(x(8)+u0(5))^2+(x(9)+u0(6))^2)^1.5;
    %%%%%%%%%%%%%%%%
    q0=sqrt(1-x(14)^2-x(15)^2-x(16)^2);q1=x(14);q2=x(15);q3=x(16);
    %dx=x(20);dy=x(21);dz=x(22);
    bx=x(17);by=x(18);bz=x(19);
    dx=0;dy=0;dz=0;
    Wx=u0(22)-(1-2*q2^2-2*q3^2)*x(10)-2*(q1*q2+q0*q3)*x(11)-2*(q1*q3-q0*q2)*x(12)-bx-dx;
    Wy=u0(23)-2*(q1*q2+q0*q3)*x(10)-(1-2*q1^2-2*q3^2)*x(11)-2*(q2*q3-q0*q1)*x(12)-by-dy;
    Wz=u0(24)-2*(q1*q3+q0*q2)*x(10)-2*(q2*q3-q0*q1)*x(11)-(1-2*q1^2-2*q2^2)*x(12)-bz-dz;
    dq0_dq1=-q1*(q0)^(-1/2);dq0_dq2=-q2*(q0)^(-1/2);dq0_dq3=-q3*(q0)^(-1/2);
    
    dWx_dq1=-2*(q2+dq0_dq1*q3)*x(11)-2*(q3-dq0_dq1*q2)*x(12);
    dWx_dq2=4*q2*x(10)-2*(q1+dq0_dq2*q3)*x(11)-2*(-dq0_dq2*q2-q0)*x(12);
    dWx_dq3=4*q3*x(10)-2*(q0+dq0_dq3*q3)*x(11)-2*(q1-dq0_dq3*q2)*x(12);    
    dWy_dq1=-2*(q2-dq0_dq1*q3)*x(10)+4*q1*x(11)-2*(dq0_dq1*q1+q0)*x(12);
    dWy_dq2=-2*(q1-dq0_dq2*q3)*x(10)-2*(dq0_dq2*q1+q3)*x(12);
    dWy_dq3=-2*(-q0-dq0_dq3*q3)*x(10)+4*q3*x(11)-2*(dq0_dq3*q1+q2)*x(12);    
    dWz_dq1=-2*(q3+dq0_dq1*q2)*x(10)-2*(-dq0_dq1*q1-q0)*x(11)+4*q1*x(12);
    dWz_dq2=-2*(q0+dq0_dq2*q2)*x(10)-2*(-dq0_dq2*q1+q3)*x(11)+4*q2*x(12);
    dWz_dq3=-2*(q1+dq0_dq3*q2)*x(10)-2*(-dq0_dq3*q1+q2)*x(11);
    
    ddotq1_dq1=0.5*(Wx*dq0_dq1+dWx_dq1*q0+dWz_dq1*q2-dWy_dq1*q3);
    ddotq1_dq2=0.5*(Wx*dq0_dq2+dWx_dq2*q0+dWz_dq2*q2+Wz-dWy_dq2*q3);
    ddotq1_dq3=0.5*(Wx*dq0_dq3+dWx_dq3*q0+dWz_dq3*q2-dWy_dq3*q3-Wy);
    ddotq2_dq1=0.5*(Wy*dq0_dq1+dWy_dq1*q0-dWz_dq1*q1-Wz+dWx_dq1*q3);
    ddotq2_dq2=0.5*(Wy*dq0_dq2+dWy_dq2*q0-dWz_dq2*q1+dWx_dq2*q3);
    ddotq2_dq3=0.5*(Wy*dq0_dq3+dWy_dq3*q0-dWz_dq3*q1+dWx_dq3*q3+Wx);    
    ddotq3_dq1=0.5*(Wz*dq0_dq1+dWz_dq1*q0+dWy_dq1*q1+Wy-dWx_dq1*q2);
    ddotq3_dq2=0.5*(Wz*dq0_dq2+dWz_dq2*q0+dWy_dq2*q1-dWx_dq2*q2-Wx);
    ddotq3_dq3=0.5*(Wz*dq0_dq3+dWz_dq3*q0+dWy_dq3*q1-dWx_dq3*q2);
    
    dWx_dWex=-(1-2*q2^2-2*q3^2);
    dWx_dWey=-2*(q1*q2+q0*q3);
    dWx_dWez=-2*(q1*q3-q0*q2);
    dWy_dWex=-2*(q1*q2-q0*q3);
    dWy_dWey=-(1-2*q1^2-2*q3^2);
    dWy_dWez=-2*(q2*q3+q0*q1);
    dWz_dWex=-2*(q1*q3+q0*q2);
    dWz_dWey=-2*(q2*q3-q0*q1);
    dWz_dWez=-(1-2*q1^2-2*q2^2);
    
    ddotq1_dWex=0.5*(q0*dWx_dWex+q2*dWz_dWex-q3*dWy_dWex);
    ddotq1_dWey=0.5*(q0*dWx_dWey+q2*dWz_dWey-q3*dWy_dWey);
    ddotq1_dWez=0.5*(q0*dWx_dWez+q2*dWz_dWez-q3*dWy_dWez);
    ddotq2_dWex=0.5*(q0*dWy_dWex-q1*dWz_dWex+q3*dWx_dWex);
    ddotq2_dWey=0.5*(q0*dWy_dWey-q1*dWz_dWey+q3*dWx_dWey);
    ddotq2_dWez=0.5*(q0*dWy_dWez-q1*dWz_dWez+q3*dWx_dWez);
    ddotq3_dWex=0.5*(q0*dWz_dWex+q1*dWy_dWex-q2*dWx_dWex);
    ddotq3_dWey=0.5*(q0*dWz_dWey+q1*dWy_dWey-q2*dWx_dWey);
    ddotq3_dWez=0.5*(q0*dWz_dWez+q1*dWy_dWez-q2*dWx_dWez); 
        
    ddotq1_dbx=0.5*(q0*(-1));
    ddotq1_dby=-0.5*(q3*(-1));
    ddotq1_dbz=0.5*(q2*(-1));
    ddotq2_dbx=0.5*(q3*(-1));
    ddotq2_dby=0.5*(q0*(-1));
    ddotq2_dbz=-0.5*(q1*(-1));
    ddotq3_dbx=-0.5*(q2*(-1));
    ddotq3_dby=0.5*(q1*(-1));
    ddotq3_dbz=0.5*(q0*(-1));    
    
%     AA=[  0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0  -a407 -a408  -a409 -a410 -a411 -a412  -a413    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0  -a507 -a508  -a509 -a510 -a511 -a512  -a513    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0  -a607 -a608  -a609 -a610 -a611 -a612  -a613    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0  ddotq1_dWex  ddotq1_dWey  ddotq1_dWez   0   ddotq1_dq1   ddotq1_dq2    ddotq1_dq3   ddotq1_dbx  ddotq1_dby  ddotq1_dbz   ddotq1_dbx  ddotq1_dby  ddotq1_dbz;
%           0    0    0    0    0    0    0    0    0  ddotq2_dWex  ddotq2_dWey  ddotq2_dWez   0   ddotq2_dq1   ddotq2_dq2    ddotq2_dq3   ddotq2_dbx  ddotq2_dby  ddotq2_dbz   ddotq2_dbx  ddotq2_dby  ddotq2_dbz;
%           0    0    0    0    0    0    0    0    0  ddotq3_dWex  ddotq3_dWey  ddotq3_dWez   0   ddotq3_dq1   ddotq3_dq2    ddotq3_dq3   ddotq3_dbx  ddotq3_dby  ddotq3_dbz   ddotq3_dbx  ddotq3_dby  ddotq3_dbz;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
%           0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0];
%faik=eye(22)+AA*5+AA*AA*5^2/2+AA^3*5^3/6+AA^4*5^4/24+AA^5*5^5/120+AA^6*5^6/720+AA^7*5^7/5040;
    AA=[  0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    1    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0  -a407 -a408  -a409 -a410 -a411 -a412  -a413    0    0    0    0    0    0;
          0    0    0    0    0    0  -a507 -a508  -a509 -a510 -a511 -a512  -a513    0    0    0    0    0    0;
          0    0    0    0    0    0  -a607 -a608  -a609 -a610 -a611 -a612  -a613    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0  ddotq1_dWex  ddotq1_dWey  ddotq1_dWez   0   ddotq1_dq1   ddotq1_dq2    ddotq1_dq3   ddotq1_dbx  ddotq1_dby  ddotq1_dbz;
          0    0    0    0    0    0    0    0    0  ddotq2_dWex  ddotq2_dWey  ddotq2_dWez   0   ddotq2_dq1   ddotq2_dq2    ddotq2_dq3   ddotq2_dbx  ddotq2_dby  ddotq2_dbz;
          0    0    0    0    0    0    0    0    0  ddotq3_dWex  ddotq3_dWey  ddotq3_dWez   0   ddotq3_dq1   ddotq3_dq2    ddotq3_dq3   ddotq3_dbx  ddotq3_dby  ddotq3_dbz;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0;
          0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0    0];
    faik=eye(19)+AA*10+AA*AA*10^2/2+AA^3*10^3/6+AA^4*10^4/24+AA^5*10^5/120;
    Xk0=Xk10;%%%%%%%%%%%  Xk+1/k
 